#+STARTUP: showall

* Equivalent Mutants

** Major 

| Mutant | Line | Original Statement   | Mutated Statement    |
|--------+------+----------------------+----------------------|
| 4_ROR  | 1416 | i < nodesList.size() | i != nodesList.size()|
| 13_LVR | 1429 | sifs + 2 * slot;     | sifs + 0 * slot;     |
| 14_LVR | 1429 | sifs + 2 * slot;     | sifs + (-2) * slot;  |
| 15_AOR | 1429 | 2 * slot             | 2 % slot             |
| 16_AOR | 1429 | 2 * slot             | 2 + slot             |
| 17_AOR | 1429 | 2 * slot             | 2 - slot             |
| 18_AOR | 1429 | 2 * slot             | 2 / slot             |
| 19_AOR | 1429 | sifs + 2 * slot      | sifs % (2 * slot)    |
| 20_AOR | 1429 | sifs + 2 * slot      | sifs * (2 * slot)    |
| 21_AOR | 1429 | sifs + 2 * slot      | sifs - (2 * slot)    |
| 22_AOR | 1429 | sifs + 2 * slot      | sifs / (2 * slot)    |
|--------+------+----------------------+----------------------|
| Total  |   11 |                      |                      |
#+TBLFM: @13$2=vcount(@I..II)

** PIT: Default Mutation Operators

| Mutant           | Line |
|------------------+------|
| MathMutator_1429 | 1429 |
| MathMutator_1429 | 1429 |
|------------------+------|
| Total            | 2    |

** PIT: ALL Mutation Operators: Equivalents

| Mutant                     | Line | Original Statement | Mutated Statement |
|----------------------------+------+--------------------+-------------------|
| MathMutator_1429_1         | 1429 | sifs + 2 * slot    | sifs + 2 / slot   |
| MathMutator_1429_2         | 1429 | sifs + 2 * slot    | sifs - 2 * slot   |
| InlineConstantMutator_1429 | 1429 | sifs + 2 * slot    | sifs + 1 * slot   |
|----------------------------+------+--------------------+-------------------|
| Total                      |    3 |                    |                   |

** Mujava3

| Mutant    | Line | Original Statement                                                                            | Mutated Statement                                                                               |
|-----------+------+-----------------------------------------------------------------------------------------------+-------------------------------------------------------------------------------------------------|
| AORB_952  | 1089 | float nAifsd = sifs + 2 * slot;                                                               | float nAifsd = sifs + 2 - slot;                                                                 |
| AOIS_2256 | 1124 | nd.params.InitParams( id, rate, xPosition, yPosition, coverage, ac, nAifsd, nCwMin, nCwMax ); | nd.params.InitParams( id--, rate, xPosition, yPosition, coverage, ac, nAifsd, nCwMin, nCwMax ); |
| AORB_951  | 1089 | float nAifsd = sifs + 2 * slot;                                                               | float nAifsd = sifs + 2 + slot;                                                                 |
| AOIS_2259 | 1124 | nd.params.InitParams( id, rate, xPosition, yPosition, coverage, ac, nAifsd, nCwMin, nCwMax ); | nd.params.InitParams( id, rate, xPosition++, yPosition, coverage, ac, nAifsd, nCwMin, nCwMax ); |
| AOIS_2269 | 1124 | nd.params.InitParams( id, rate, xPosition, yPosition, coverage, ac, nAifsd, nCwMin, nCwMax ); | nd.params.InitParams( id, rate, xPosition, yPosition, coverage, ac, nAifsd, nCwMin++, nCwMax ); |
| AOIU_257  | 1088 | int nCwMax = SpecParams.CW_MAX;                                                               | int nCwMax = -SpecParams.CW_MAX;                                                                |
| AOIS_2264 | 1124 | nd.params.InitParams( id, rate, xPosition, yPosition, coverage, ac, nAifsd, nCwMin, nCwMax ); | nd.params.InitParams( id, rate, xPosition, yPosition, coverage--, ac, nAifsd, nCwMin, nCwMax ); |
| AOIS_2267 | 1124 | nd.params.InitParams( id, rate, xPosition, yPosition, coverage, ac, nAifsd, nCwMin, nCwMax ); | nd.params.InitParams( id, rate, xPosition, yPosition, coverage, ac, nAifsd++, nCwMin, nCwMax ); |
| LOI_658   | 1088 | int nCwMax = SpecParams.CW_MAX;                                                               | int nCwMax = -SpecParams.CW_MAX;                                                                |
| AOIS_2265 | 1124 | nd.params.InitParams( id, rate, xPosition, yPosition, coverage, ac, nAifsd, nCwMin, nCwMax ); | nd.params.InitParams( id, rate, xPosition, yPosition, coverage, ac++, nAifsd, nCwMin, nCwMax ); |
| AORB_954  | 1089 | float nAifsd = sifs + 2 * slot;                                                               | float nAifsd = sifs / (2 * slot);                                                               |
| AOIS_2255 | 1124 | nd.params.InitParams( id, rate, xPosition, yPosition, coverage, ac, nAifsd, nCwMin, nCwMax ); | nd.params.InitParams( id++, rate, xPosition, yPosition, coverage, ac, nAifsd, nCwMin, nCwMax ); |
| AOIS_2258 | 1124 | nd.params.InitParams( id, rate, xPosition, yPosition, coverage, ac, nAifsd, nCwMin, nCwMax ); | nd.params.InitParams( id, rate--, xPosition, yPosition, coverage, ac, nAifsd, nCwMin, nCwMax ); |
| AORB_950  | 1089 | float nAifsd = sifs + 2 * slot;                                                               | float nAifsd = sifs + 2 % slot;                                                                 |
| AOIS_2128 | 1084 | throw new pamvotis.exceptions.ElementExistsException( "Node " + id + " already exists." );    | throw new pamvotis.exceptions.ElementExistsException( "Node " + id-- + " already exists." );    |
| AOIS_2257 | 1124 | nd.params.InitParams( id, rate, xPosition, yPosition, coverage, ac, nAifsd, nCwMin, nCwMax ); | nd.params.InitParams( id, rate++, xPosition, yPosition, coverage, ac, nAifsd, nCwMin, nCwMax ); |
| AOIU_258  | 1089 | float nAifsd = sifs + 2 * slot;                                                               | float nAifsd = -sifs + 2 * slot;                                                                |
| AOIS_2263 | 1124 | nd.params.InitParams( id, rate, xPosition, yPosition, coverage, ac, nAifsd, nCwMin, nCwMax ); | nd.params.InitParams( id, rate, xPosition, yPosition, coverage++, ac, nAifsd, nCwMin, nCwMax ); |
| AOIS_2262 | 1124 | nd.params.InitParams( id, rate, xPosition, yPosition, coverage, ac, nAifsd, nCwMin, nCwMax ); | nd.params.InitParams( id, rate, xPosition, yPosition--, coverage, ac, nAifsd, nCwMin, nCwMax ); |
| AORB_955  | 1089 | float nAifsd = sifs + 2 * slot;                                                               | float nAifsd = sifs % (2 * slot);                                                               |
| AOIS_2270 | 1124 | nd.params.InitParams( id, rate, xPosition, yPosition, coverage, ac, nAifsd, nCwMin, nCwMax ); | nd.params.InitParams( id, rate, xPosition, yPosition, coverage, ac, nAifsd, nCwMin--, nCwMax ); |
| AOIS_2272 | 1124 | nd.params.InitParams( id, rate, xPosition, yPosition, coverage, ac, nAifsd, nCwMin, nCwMax ); | nd.params.InitParams( id, rate, xPosition, yPosition, coverage, ac, nAifsd, nCwMin, nCwMax-- ); |
| AOIS_2260 | 1124 | nd.params.InitParams( id, rate, xPosition, yPosition, coverage, ac, nAifsd, nCwMin, nCwMax ); | nd.params.InitParams( id, rate, xPosition--, yPosition, coverage, ac, nAifsd, nCwMin, nCwMax ); |
| AOIS_2271 | 1124 | nd.params.InitParams( id, rate, xPosition, yPosition, coverage, ac, nAifsd, nCwMin, nCwMax ); | nd.params.InitParams( id, rate, xPosition, yPosition, coverage, ac, nAifsd, nCwMin, nCwMax++ ); |
| LOI_657   | 1087 | int nCwMin = cwMin;                                                                           | int nCwMin = ~cwMin;                                                                            |
| AORB_949  | 1089 | float nAifsd = sifs + 2 * slot;                                                               | float nAifsd = sifs + 2 / slot;                                                                 |
| AORB_956  | 1089 | float nAifsd = sifs + 2 * slot;                                                               | float nAifsd = sifs - 2 * slot;                                                                 |
| AORB_953  | 1089 | float nAifsd = sifs + 2 * slot;                                                               | float nAifsd = sifs * (2 * slot);                                                               |
| AOIS_2127 | 1084 | throw new pamvotis.exceptions.ElementExistsException( "Node " + id + " already exists." );    | throw new pamvotis.exceptions.ElementExistsException( "Node " + id++ + " already exists." );    |
| AOIS_2266 | 1124 | nd.params.InitParams( id, rate, xPosition, yPosition, coverage, ac, nAifsd, nCwMin, nCwMax ); | nd.params.InitParams( id, rate, xPosition, yPosition, coverage, ac--, nAifsd, nCwMin, nCwMax ); |
| AOIS_2261 | 1124 | nd.params.InitParams( id, rate, xPosition, yPosition, coverage, ac, nAifsd, nCwMin, nCwMax ); | nd.params.InitParams( id, rate, xPosition, yPosition++, coverage, ac, nAifsd, nCwMin, nCwMax ); |
| AOIS_2268 | 1124 | nd.params.InitParams( id, rate, xPosition, yPosition, coverage, ac, nAifsd, nCwMin, nCwMax ); | nd.params.InitParams( id, rate, xPosition, yPosition, coverage, ac, nAifsd--, nCwMin, nCwMax ); |
| AOIU_256  | 1087 | int nCwMin = cwMin;                                                                           | int nCwMin = -cwMin;                                                                            |
|-----------+------+-----------------------------------------------------------------------------------------------+-------------------------------------------------------------------------------------------------|
| Total     |   33 |                                                                                               |                                                                                                 |
#+TBLFM: @35$2=vcount(@I..II)


* Common Equivalent

** Major - PIT ALL

| Major  | PIT ALL            |
|--------+--------------------|
| 21_AOR | MathMutator_1429_2 |
| 18_AOR | MathMutator_1429_1 |

** Major - Mujava3

| Major  | Mujava3  |
|--------+----------|
| 15_AOR | AORB_950 |
| 16_AOR | AORB_951 |
| 17_AOR | AORB_952 |
| 18_AOR | AORB_949 |
| 19_AOR | AORB_955 |
| 20_AOR | AORB_953 |
| 21_AOR | AORB_956 |
| 22_AOR | AORB_954 |

** PIT ALL - Mujava3

| PIT ALL            | Mujava3  |
|--------------------+----------|
| MathMutator_1429_1 | AORB_949 |
| MathMutator_1429_2 | AORB_956 |

** Common equivs among all tools

| Major  | PIT ALL            | Mujava3  |
|--------+--------------------+----------|
| 21_AOR | MathMutator_1429_2 | AORB_956 |
| 18_AOR | MathMutator_1429_1 | AORB_949 |
